** Compute Word frequency
#+BEGIN_SRC python :results output
mydoclist = ['Julie loves me more than Linda loves me',
'Jane likes me more than Julie loves me',
'He likes basketball more than baseball']

#mydoclist = ['sun sky bright', 'sun sun bright']

from collections import Counter

for doc in mydoclist:
    tf = Counter()
    for word in doc.split():
        tf[word] +=1
    print tf.items()
#+END_SRC

#+RESULTS:
: [('me', 2), ('Julie', 1), ('loves', 2), ('Linda', 1), ('than', 1), ('more', 1)]
: [('me', 2), ('Julie', 1), ('likes', 1), ('loves', 1), ('Jane', 1), ('than', 1), ('more', 1)]
: [('basketball', 1), ('baseball', 1), ('likes', 1), ('He', 1), ('than', 1), ('more', 1)]
** Making all the vectors in the same vector space
Let's call this a first stab at representing documents quantitatively, just by their word counts. But for those of you who are already tipped off by the "vector" in the vector space model, these aren't really comparable. This is because they're not in the same vocabulary space.

What we really want is for every document to be the same length, where length is determined by the total vocabulary of our corpus.

#+BEGIN_SRC python :results output

import string #allows for format()

mydoclist = ['Julie loves me more than Linda loves me',
'Jane likes me more than Julie loves me',
'He likes basketball more than baseball']
    
def build_lexicon(corpus):
    lexicon = set()
    for doc in corpus:
        lexicon.update([word for word in doc.split()])
    return lexicon

def tf(term, document):
  return freq(term, document)

def freq(term, document):
  return document.split().count(term)

vocabulary = build_lexicon(mydoclist)

doc_term_matrix = []
print 'Our vocabulary vector is [' + ', '.join(list(vocabulary)) + ']'

for doc in mydoclist:
    print 'The doc is "' + doc + '"'
    tf_vector = [tf(word, doc) for word in vocabulary]
    tf_vector_string = ', '.join(format(freq, 'd') for freq in tf_vector)
    print "tf_vector in detail", zip(tf_vector, vocabulary)
    print 'The tf vector for Document %d is [%s]' % ((mydoclist.index(doc)+1), tf_vector_string)
    doc_term_matrix.append(tf_vector)
    
    # here's a test: why did I wrap mydoclist.index(doc)+1 in parens?  it returns an int...
    # try it!  type(mydoclist.index(doc) + 1)

print 'All combined, here is our master document term matrix: '
print doc_term_matrix
#+END_SRC

#+RESULTS:
#+begin_example
Our vocabulary vector is [me, basketball, Julie, baseball, likes, loves, Jane, Linda, He, than, more]
The doc is "Julie loves me more than Linda loves me"
tf_vector in detail [(2, 'me'), (0, 'basketball'), (1, 'Julie'), (0, 'baseball'), (0, 'likes'), (2, 'loves'), (0, 'Jane'), (1, 'Linda'), (0, 'He'), (1, 'than'), (1, 'more')]
The tf vector for Document 1 is [2, 0, 1, 0, 0, 2, 0, 1, 0, 1, 1]
The doc is "Jane likes me more than Julie loves me"
tf_vector in detail [(2, 'me'), (0, 'basketball'), (1, 'Julie'), (0, 'baseball'), (1, 'likes'), (1, 'loves'), (1, 'Jane'), (0, 'Linda'), (0, 'He'), (1, 'than'), (1, 'more')]
The tf vector for Document 2 is [2, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1]
The doc is "He likes basketball more than baseball"
tf_vector in detail [(0, 'me'), (1, 'basketball'), (0, 'Julie'), (1, 'baseball'), (1, 'likes'), (0, 'loves'), (0, 'Jane'), (0, 'Linda'), (1, 'He'), (1, 'than'), (1, 'more')]
The tf vector for Document 3 is [0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1]
All combined, here is our master document term matrix: 
[[2, 0, 1, 0, 0, 2, 0, 1, 0, 1, 1], [2, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1], [0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1]]
#+end_example

** Normalizing vectors to L2 Norm = 1

Okay, that seems reasonable enough. If any of you have any experience with machine learning, what you've just seen is the creation of a feature space. Now every document is in the same feature space, meaning that we can represent the entire corpus in the same dimensional space without having lost too much information.
Normalizing vectors to L2 Norm = 1

Once you've got your data in the same feature space, you can start applying some machine learning methods; classifying, clustering, and so on. But actually, we've got a few problems. Words aren't all equally informative.

If words appear too frequently in a single document, they're going to muck up our analysis. We want to perform some scaling of each of these term frequency vectors into something a bit more representative. In other words, we need to do some vector normalizing.

We don't really have the time to go into the intense math of this. Just accept for now that we need to ensure that the L2 norm of each vector is equal to 1. Here's some code that shows how this is done.

#+BEGIN_SRC python :results output

import math
import numpy as np

doc_term_matrix = [[2, 0, 1, 0, 0, 2, 0, 1, 0, 1, 1], [2, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1], [0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1]]  # computed in blocks before

def l2_normalizer(vec):
    denom = np.sum([el**2 for el in vec])
    return [(el / math.sqrt(denom)) for el in vec]

doc_term_matrix_l2 = []
for vec in doc_term_matrix:
    doc_term_matrix_l2.append(l2_normalizer(vec))

print 'A regular old document term matrix: ' 
print np.matrix(doc_term_matrix)
print '\nA document term matrix with row-wise L2 norms of 1:'
print np.matrix(doc_term_matrix_l2)

# if you want to check this math, perform the following:
# from numpy import linalg as la
# la.norm(doc_term_matrix[0])
# la.norm(doc_term_matrix_l2[0])


#+END_SRC

#+RESULTS:
#+begin_example
A regular old document term matrix: 
[[2 0 1 0 0 2 0 1 0 1 1]
 [2 0 1 0 1 1 1 0 0 1 1]
 [0 1 0 1 1 0 0 0 1 1 1]]

A document term matrix with row-wise L2 norms of 1:
[[ 0.57735027  0.          0.28867513  0.          0.          0.57735027
   0.          0.28867513  0.          0.28867513  0.28867513]
 [ 0.63245553  0.          0.31622777  0.          0.31622777  0.31622777
   0.31622777  0.          0.          0.31622777  0.31622777]
 [ 0.          0.40824829  0.          0.40824829  0.40824829  0.          0.
   0.          0.40824829  0.40824829  0.40824829]]
#+end_example

** IDF Frequency weighting

Not bad. Without getting too deeply mired into the linear algebra, you can see immediately that we've scaled down vectors such that each element is between [0, 1], without losing too much valuable information. You see how it's no longer the case that a term count of 1 is the same value in one vector as another?

Why would we care about this kind of normalizing? Think about it this way; if you wanted to make a document seem more related to a particular topic than it actually was, you might try boosting the likelihood of its inclusion into a topic by repeating the same word over and over and over again. Frankly, at a certain point, we're getting a diminishing return on the informative value of the word. So we need to scale down words that appear too frequently in a document.


IDF frequency weighting

But we're still not there yet. Just as all words aren't equally valuable within a document, not all words are valuable across all documents. We can try reweighting every word by its inverse document frequency. Let's see what's involved in that.
#+BEGIN_SRC python :results output

import numpy as np

mydoclist = ['Julie loves me more than Linda loves me',
'Jane likes me more than Julie loves me',
'He likes basketball more than baseball']
    
def build_lexicon(corpus):
    lexicon = set()
    for doc in corpus:
        lexicon.update([word for word in doc.split()])
    return lexicon

def tf(term, document):
  return freq(term, document)

def freq(term, document):
  return document.split().count(term)

vocabulary = build_lexicon(mydoclist)


def numDocsContaining(word, doclist):
    doccount = 0
    for doc in doclist:
        if freq(word, doc) > 0:
            doccount +=1
    return doccount 

def idf(word, doclist):
    n_samples = len(doclist)
    df = numDocsContaining(word, doclist)
    return np.log(n_samples / 1+df)

my_idf_vector = [idf(word, mydoclist) for word in vocabulary]

print 'Our vocabulary vector is [' + ', '.join(list(vocabulary)) + ']'
print 'The inverse document frequency vector is [' + ', '.join(format(freq, 'f') for freq in my_idf_vector) + ']'


#+END_SRC

#+RESULTS:
: Our vocabulary vector is [me, basketball, Julie, baseball, likes, loves, Jane, Linda, He, than, more]
: The inverse document frequency vector is [1.609438, 1.386294, 1.609438, 1.386294, 1.609438, 1.609438, 1.386294, 1.386294, 1.386294, 1.791759, 1.791759]

** TF * IDF
Now we have a general sense of information values per term in our vocabulary, accounting for their relative frequency across the entire corpus. Recall that this is an inverse! The more negative a term, the more frequent it is.

We're almost there. To get TF-IDF weighted word vectors, you have to perform the simple calculation of tf * idf.

Time to take a step back. Recall from linear algebra that if you multiply a vector of A x B by a vector of A x B, you're going to get a vector of size A x A, or a scalar. This won't do, since what we want is a term vector of the same dimensions (1 x number of terms), where each element has been scaled by this idf weighting. How do we do that in Python?

We could write the whole function out here, but instead we're going to show a brief introduction into numpy.
#+BEGIN_SRC python :results output

import numpy as np

def build_idf_matrix(idf_vector):
    idf_mat = np.zeros((len(idf_vector), len(idf_vector)))
    np.fill_diagonal(idf_mat, idf_vector)
    return idf_mat

my_idf_vector = [1.609438, 1.386294, 1.609438, 1.386294, 1.609438, 1.609438, 1.386294, 1.386294, 1.386294, 1.791759, 1.791759]
my_idf_matrix = build_idf_matrix(my_idf_vector)

print my_idf_matrix

#+END_SRC

#+RESULTS:
#+begin_example
[[ 1.609438  0.        0.        0.        0.        0.        0.        0.
   0.        0.        0.      ]
 [ 0.        1.386294  0.        0.        0.        0.        0.        0.
   0.        0.        0.      ]
 [ 0.        0.        1.609438  0.        0.        0.        0.        0.
   0.        0.        0.      ]
 [ 0.        0.        0.        1.386294  0.        0.        0.        0.
   0.        0.        0.      ]
 [ 0.        0.        0.        0.        1.609438  0.        0.        0.
   0.        0.        0.      ]
 [ 0.        0.        0.        0.        0.        1.609438  0.        0.
   0.        0.        0.      ]
 [ 0.        0.        0.        0.        0.        0.        1.386294  0.
   0.        0.        0.      ]
 [ 0.        0.        0.        0.        0.        0.        0.        1.386294
   0.        0.        0.      ]
 [ 0.        0.        0.        0.        0.        0.        0.        0.
   1.386294  0.        0.      ]
 [ 0.        0.        0.        0.        0.        0.        0.        0.
   0.        1.791759  0.      ]
 [ 0.        0.        0.        0.        0.        0.        0.        0.
   0.        0.        1.791759]]
#+end_example

